import Layout from "@/components/Layout";
import React from "react";
import Link from "next/link";
import Image from "next/image";

export default function History() {
  const history = {
    1: "  จังหวัด นครศรีธรรมราช เมืองโบราณเก่าแก่ที่มีความสําคัญทั้งในด้านเศรษฐกิจ สังคม การเมือง การปกครอง และศาสนามากที่สุดแห่งหนึ่งในภูมิภาคเอเชียตะวันออกเฉียงใต้เลยค่ะ โดยนครศรีธรรมราชนั้นมีชื่อเสียงและเป็นที่รู้จักกันอย่างกว้างขวาง มาไม่น้อยกว่า 1,800 ปีมาแล้ว เพราะมีหลักฐานทางโบราณคดี และหลักฐานทางเอกสารที่ปรากฏและยืนยันได้ว่านครศรีธรรมราช มีกําเนิดมาแล้ว ตั้งแต่พุทธศตวรรษที่ 7 เลยทีเดียว",
    2: " ซึ่งจากประวัติศาสตร์อันยาวนานนี้เอง ทำให้ นครศรีธรรมราช ปรากฏชื่อในที่ต่างๆ มากมายหลายชื่อตามแต่ละท้องถิ่นที่สืบทอดกันมา อีกทั้งแต่ละสําเนียงของภาษาและระยะเวลาที่ต่างกันไปในช่วงยุคสมัยต่างๆ ด้วย ทั้ง ตามพลิงคม ตามพรลิงค์ มัทธาลิงคม ตามพลิงเกศวร โฮลิง โพลิง เชียะโท้ว โลแค็ก สิริธรรมนคร ศรีธรรมราช ลิกอร์ ละคอน คิวตูตอน สุวรรณปุระ ปาฏลีบุตร (Pataliputra) และ เมืองนคร เป็นต้น",
    3: "    ส่วนคำว่า นครศรีธรรมราช นั้น ก็มาจากคำสร้อยของพระนามของปฐมกษัตริย์ ผู้ครอง นครศรีธรรมราช คือพระเจ้าศรีธรรมาโศกราช โดยมีความหมายว่า *นครอันงานสง่าแห่ง พระราชาผู้ทรงธรรม* และธรรมของราชาแห่งนครนี้ ก็คือ ธรรมแห่ง พระพุทธศาสนา นั่นเองค่ะ",
    4: "     และหลักฐานที่มีการพบนั้น ก็มีตั้งแต่เครื่องหิน ที่มีตัวขวานยาวใหญ่ บางคนจะเรียกว่าระนาดหิน ที่อําเภอท่าศาลา อยู่ในยุคของโลหะ รวมไปถึงหลักฐานทางโบราณคดี คือ กลองมโหระทึกสําริด 2 ใบ ที่บ้านเกตุ กาย ตําบลท่าเรือ อําเภอเมือง และที่คลองคุดด้วน อําเภอฉวาง เช่นเดียวกันค่ะ",
    5: " รวมถึงในบริเวณพื้นที่ของอําเภอสิชลในปัจจุบันนี้ ก็ยังมีร่องรอยโบราณสถานและโบราณวัตถุ ที่เกี่ยวข้องกับศาสนาพราหมณ์ ซึ่งมีอายุเก่าแก่ที่สุดใน นครศรีธรรมราช อีกด้วย ทั้ง พระพุทธรูปสําริด ศิลปแบบอมราวดีของอินเดีย และเศียรพระพุทธรูปศิลปแบบคุปตะอินเดีย เป็นต้น โดยแสดงให้เห็นว่านครศรีธรรมราชนั้น ได้รับอิทธิพลมาจากวัฒนธรรมอินเดียอย่างมาก ทั้ง ด้านศาสนา ความเชื่อ อักษร ภาษา ประเพณี และการปกครอง จนกลายมาเป็นพื้นฐานวัฒนธรรม ของนครศรีธรรมราชมาถึงในปัจจุบันนั่นเอง",
    title2: "ยุครุ่งเรือง และ จุดเริ่มต้นของ เมืองสิบสองนักษัตร",
    6: " โดยในช่วงพุทธศตวรรษที่ 17-19 นั้นจะเป็นช่วงที่นครศรีธรรมราชมีความเจริญรุ่งเรืองสูงสุดเลยก็ว่าได้ เพราะจากการเป็นสถานีการค้าสําคัญของคาบสมุทรไทยนั่นเอง รวมถึงพุทธศาสนาที่เข้ามามีบทบาทมากขึ้น เลยเป็นสิ่งหนึ่งที่ชักนําผู้คนมาตั้งถิ่นฐานในนครศรีธรรมราชนี้ค่ะ ซึ่งการจัดการการปกครองนั้น จะแบ่งเป็นหัวเมืองอยู่รายรอบ มากถึง 12 เมือง เรียกว่า เมืองสิบสองนักษัตร ",
    title3: `นครศรีธรรมราช ใน สมัยกรุงรัตนโกสินทร์ `,
    7: "จนมาถึงในช่วงการตั้งกรุงรัตนโกสินทร์เป็นราชธานีนั้น ได้มีการแต่งตั้งอุปราช (พัฒน์) บุตรเขยของพระเจ้านครศรีธรรมราช (หนู) ขึ้นเป็น เจ้าพระยานครศรีธรรมราช จนมาถึงสมัยรัชกาลที่ 2 มีการแต่งตั้ง พระบริรักษ์ ภูเบศรผู้ช่วยราชการเมืองนครศรีธรรมราชเป็นเจ้าเมืองนครศรีธรรมราช จนกระทั่งได้รับการแต่งตั้งเป็นเจ้าพระยานครศรีธรรมราช ที่คนทั่วไปรู้จักกันในนามของ เจ้าพระยานครน้อย ค่ะ",
    8: "และในสมัยรัชกาลที่ 5 ที่มีการเปลี่ยนแปลง การบริหาร ราชการแผ่นดินด้านการปกครองหัวเมืองนั้น เลยโปรดฯ ให้มีการแต่งตั้ง ตําแหน่งอุปราชปักษ์ใต้ขึ้น เพื่อปกครองหัวเมืองปักษ์ใต้ทั้งหมด และได้ทรงพระกรุณาโปรดเกล้าฯ แต่งตั้งสมเด็จเจ้าฟ้ายุคลทิฆัมพร กรมหลวงลพบุรี ราเมศวร์ดํารงตําแหน่ง อุปราชปักษ์ใต้ ค่ะ จนกระทั่งมีการเปลี่ยนแปลงการปกครองในปี พ.ศ. 2475 จึงได้ยุบมณฑล นครศรีธรรมราช ลง และกลายมาเป็นจังหวัดหนึ่งของราชอาณาจักรไทย จนถึงในปัจจุบันนั่นเอง",
    title4: "คำขวัญประจำจังหวัดนครศรีธรรมราช",
    9: " เราชาวนครฯ อยู่เมืองพระ มั่นอยู่ในสัจจะ ศีลธรรม กอปรกรรมดี มีมานะ พากเพียร ไม่เบียดเบียน ทำอันตรายผู้ใด ",
    img1: "https://th.bing.com/th/id/R.a21e85197b2dc7c2649fd635711f4905?rik=VpGIuAValk8FbQ&riu=http%3a%2f%2f1.bp.blogspot.com%2f-KSSmvNOnV1o%2fVO16EU3ZmUI%2fAAAAAAAAAAg%2fbFExeI7-amA%2fs1600%2f%e0%b8%a7%e0%b8%b1%e0%b8%94%e0%b8%9e%e0%b8%a3%e0%b8%b0%e0%b8%a1%e0%b8%ab%e0%b8%b2%e0%b8%98%e0%b8%b2%e0%b8%95%e0%b8%b8-1024x645.jpg&ehk=lkAIWNq0szc4WjuDIG0hTHXh1mYVBEsUPu47n%2btmfs0%3d&risl=&pid=ImgRaw&r=0",
    img2: "https://4.bp.blogspot.com/-yzZHb9ujTj4/WoCgtJppnWI/AAAAAAAAACk/wi9s1_SIaGIw4Uqm96hBJRjLl0sTQ6qgACLcBGAs/s1600/FB_IMG_1518379147837.jpg",
    img3: "https://th.bing.com/th/id/R.82bd110b79f2613bbf1e62da9f8985f3?rik=xYLE0vTQieHDnQ&riu=http%3a%2f%2fwww.teethiao.com%2fpph_include%2ftravelDetail%2f211fbe4fa5fefd724c08388c2c137553.jpg&ehk=MCZ9J%2fcy84OX3J36zD5dPc01AwKS1LWhYySM55ae6gg%3d&risl=&pid=ImgRaw&r=0",
    img4: "https://ik.imagekit.io/tvlk/blog/2022/01/%E0%B8%81%E0%B8%B3%E0%B9%81%E0%B8%9E%E0%B8%87%E0%B9%80%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%81%E0%B9%88%E0%B8%B201.jpg?tr=dpr-2,w-675",
    img5: "https://thumbs.dreamstime.com/b/petch-fortress-pom-phet-historical-landmark-phra-nakhon-si-ayutthaya-petch-fortress-pom-phet-historical-landmark-phra-180706944.jpg",
  };

  return (
    <Layout>
<div className="flex justify-center items-center  pt-10 ">
  <div className="max-w-screen-md p-8   rounded-xl">
    <h1 className="text-3xl bg-indigo-600 p-4 mb-8 text-white rounded-3xl text-center">
      ประวัติความเป็นมาของจังหวัดนครศรีธรรมราช
    </h1>

    <p className="mb-8 text-lg">
      จังหวัดนครศรีธรรมราช เป็นหนึ่งในจังหวัดที่สำคัญของประเทศไทยทั้งทางประวัติศาสตร์และทางศิลปวัฒนธรรม
      มีประวัติศาสตร์และวัฒนธรรมที่หลากหลายและนับถือกันมาตั้งแต่อดีตโบราณ
    </p>

    <div className="flex justify-center mb-8">
      <Image
        width={500}
        height={100}
        src={history.img1}
        alt="ภาพประกอบ"
        className="h-auto w-auto rounded-3xl shadow-2xl"
      />
    </div>

    <p className="mb-8 text-lg">{history[1]}</p>
    <p className="mb-8 text-lg">{history[2]}</p>
    <p className="mb-8 text-lg">{history[3]}</p>

    <div className="flex justify-center mb-8">
      <Image
        width={500}
        height={100}
        src={history.img2}
        alt="ภาพประกอบ"
        className="h-auto w-auto rounded-3xl shadow-2xl"
      />
    </div>

    <p className="mb-8 text-lg">{history[4]}</p>
    <p className="mb-8 text-lg">{history[5]}</p>

    <div className="flex justify-center mb-8">
      <Image
        width={500}
        height={100}
        src={history.img3}
        alt="ภาพประกอบ"
        className="h-auto w-auto rounded-3xl shadow-2xl"
      />
    </div>

    <p className="mb-8 text-lg">{history[6]}</p>

    <div className="flex justify-center mb-8">
      <Image
        width={500}
        height={100}
        src={history.img4}
        alt="ภาพประกอบ"
        className="h-auto w-auto rounded-3xl shadow-2xl"
      />
    </div>

    <p className="mb-8 text-lg">{history[7]}</p>
    <p className="mb-8 text-lg">{history[8]}</p>

    <div className="flex justify-center mb-8">
      <Image
        width={500}
        height={100}
        src={history.img5}
        alt="ภาพประกอบ"
        className="h-auto w-auto rounded-3xl shadow-2xl"
      />
    </div>

    <h2 className="text-center mb-8 text-xl mt-10">
      คำขวัญประจำจังหวัดนครศรีธรรมราช
    </h2>
    <p className="mb-8 text-lg">"{history[9]}"</p>
  </div>
</div>

    </Layout>
  );
}
